# Кое-какие настройки для бота

# id тех, кто может менять карму без ограничений
gods = [55910350]

# Бот в текущей сборке расчитан на работу с heroku.com
# Это ссылка на приложение, для установления вебхука
url = "https://khabarabot.herokuapp.com/bot"

# Имя бота (то, которое @Karmator_bot)
bot_name = "khabara_bot"

# Ссылка на Github репозиторий этого бота
source_link = "https://github.com/oldkiller/karmator_bot"

# Слова, на которые реагирует бот
popular_good_words = ["спс", "ору", "орево"]
good_words = ["пасиб", "сяп", "благодарю", "благодарность",
			"помог ", "sps", "дякую", "мерси", "лайк",
			"сенкс", "респект", "храни тебя бог", "дякую", "thx", "thanks", "thank you"] + popular_good_words
bad_words = ["говно", "пидор", "жопа", "дебил",
			"suka", "сука", "мразь", "блядь", "гондон", "хуй", "хуи"]

good_emoji = "❤😂👍🔥😆💋😘😍😜"
bad_emoji = "😡👎💩"
