# Кое-какие настройки для бота
# id тех, кто может менять карму без ограничений
gods = [55910350]

# Бот в текущей сборке расчитан на работу с heroku.com
# Это ссылка на приложение, для установления вебхука
url = "https://khabarabot.herokuapp.com/bot"

# Имя бота (то, которое @Karmator_bot)
bot_name = "khabara_bot"

# Ссылка на Github репозиторий этого бота
adminschat = "@jcrush, @Odmin_khv, @it_was_a_trap, @kroukys_Oo"

# Слова, на которые реагирует бот
popular_good_words = ["спс", "ору", "орево", "👍"]
good_words = ["спасибо","пасиб", "сяп", "благодарю", "благодарен", "благодана", "дякую", "мерси", "лайк","лойс", "сенкс", "респект", "храни тебя бог", "дякую", "thx", "thanks", "thank you"] + popular_good_words
			
bad_words = ["неблагодарный", "неблагодарная", "👎"]
mat_words = ["уеб", "ебал", "ебать", "пизд", "хуй", "хуи", "хуя", "хую", "бля"]
heppy_words = ["акция", "аттракционы", "безмятежность", "бесплатное", "благодарность", "благородство", "блаженство", "богатство", "бодрость", "божественно", "бонус", "бриллиант", "везение", "вера", "верность", "веселье", "весна", "вкуснятина", "восторг", "восхищение", "выигрыш", "выходные", "гармония", "гонорар", "гордость", "горы", "гостеприимство", "деньги", "дети", "добро", "доброта", "достаток", "достижение", "дружба", "друзья", "женитьба", "забава", "забота", "заначка", "здоровье", "знакомство", "игра", "кайф", "каникулы", "карусели", "комедия", "фильм", "конфеты", "корпоратив", "красота", "креатив", "ласка", "лёгкость", "лето", "лидер", "лучший", "любимая", "любимый", "любовь", "мамама", "медовый", "месяц", "мечта", "мир", "море", "мороженое", "награда", "надежда", "надёжность", "наслаждение", "нежность", "новый", "обновка", "объятия", "оргазм", "отдых", "отпуск", "победа", "победитель", "подарок", "позитив", "поощрение", "потеха", "поцелуй", "праздник", "преданность", "презент", "прекрасный", "прибавка", "приз", "путешествие", "пятница", "радость", "радуга", "рай", "распродажа", "ребёнок", "релакс", "рыбалка", "свадьба", "свет", "свидание", "свобода", "секс", "семья", "скидка", "сладость", "смех", "солнце", "спа", "счастье", "сюрприз", "талант", "творчество", "торжество", "триумф", "удача", "удовольствие", "украшения", "улыбка", "успех", "уют", "фарт", "фартит", "фейерверк", "халява", "хвала", "цветы", "цирк", "чемпион", "честь", "шоколад", "эйфория", "экстаз", "эскимо", "год", "поздравля", "рождество", "молодец", "воскрес", "рожден", "март", "феврал", "люблю", "суббота"]


good_emoji = "❤😂👍🔥😆💋😘😍😜"
bad_emoji = "😡👎💩"
