# Кое-какие настройки для бота
# id тех, кто может менять карму без ограничений
gods = [55910350]

# Бот в текущей сборке расчитан на работу с heroku.com
# Это ссылка на приложение, для установления вебхука
url = "https://khabarabot.herokuapp.com/bot"

# Имя бота (то, которое @Karmator_bot)
bot_name = "khabara_bot"

# Ссылка на Github репозиторий этого бота
adminschat = "@jcrush, @Odmin_khv, @it_was_a_trap, @kroukys_Oo"

# Слова, на которые реагирует бот
popular_good_words = ["спс", "ору", "орево", "👍"]
good_words = ["спасибо","пасиб", "сяп", "благодарю", "благодарен", "благодана", "дякую", "мерси", "лайк","лойс", "сенкс", "респект", "храни тебя бог", "дякую", "thx", "thanks", "thank you"] + popular_good_words
			
bad_words = ["неблагодарный", "неблагодарная", "👎"]
mat_words = ["уеб", "ебал", "ебать", "пизд", "хуй", "хуи", "хуя", "хую", "бля"]
heppy_words = ["акци", "аттракцион", "безмятежн", "бесплатн", "благодар", "благород", "блажен", "богат", "бодр", "боже", "бонус", "бриллиант", "везе", "вер", "весел", "весн", "вкус", "восторг", "восхищ", "игр", "выходн", "гармон", "гонорар", "горд", "гор", "гостеприим", "день", "дети", "добр", "достат", "дости", "друж", "друзья", "женит", "забав", "забот", "заначк", "здоров", "знаком", "игр", "кайф", "каникул", "карусел", "комед", "фильм", "конфет", "корпоратив", "красот", "креатив", "ласк", "легко", "лето", "лидер", "лучш", "люби", "любовь", "мам", "медов", "месяц", "мечт", "мир", "море", "мороженое", "наград", "надеж", "надёж", "наслажден", "нежн", "новый", "обнов", "объяти", "оргазм", "отдых", "отпуск", "побед", "новая", "подар", "позитив", "поощр", "потех", "поцел", "праздник", "преданн", "презент", "прекрас", "прибав", "приз", "путешеств", "пятниц", "радост", "радуг", "рай", "распродаж", "ребён", "релакс", "рыба", "свадьб", "свет", "свидан", "свобод", "секс", "семья", "скидк", "сладост", "смех", "солнц", "счаст", "сюрприз", "талант", "творчес", "торжеств", "триумф", "удач", "удовольств", "украшен", "улыб", "успех", "уют", "фарт", "фейерверк", "халяв", "хвал", "цвет", "цирк", "чемпион", "честь", "шоколад", "эйфори", "экстаз", "эскимо", "год", "поздрав", "рождеств", "молодец", "воскрес", "рожден", "март", "феврал", "люблю", "суббота"]

good_emoji = "❤😂👍🔥😆💋😘😍😜"
bad_emoji = "😡👎💩"

citata_words = ["Главное - не сложности, что ты перенес, а опыт, который из них получил.", "У человeкa всегдa нaйдeтcя время на ваc, eсли вы eмy не безpaзличны.", "Если человек любит, он вернется? - Если человек любит, он не уйдет.", "Не ищи девушку, ищи деньги, а девушка сама тебя найдёт.", "Лучше сделать и пожалеть, чем жалеть, о том что не сделал.", "Если спать то с королевой, если красть то милион."]
