# Кое-какие настройки для бота

# id тех, кто может менять карму без ограничений
gods = [55910350]

# Бот в текущей сборке расчитан на работу с heroku.com
# Это ссылка на приложение, для установления вебхука
url = "https://khabarabot.herokuapp.com/bot"

# Имя бота (то, которое @Karmator_bot)
bot_name = "khabara_bot"

# Ссылка на Github репозиторий этого бота
source_link = "https://khabara.ru/weather.php"

# Слова, на которые реагирует бот
popular_good_words = ["спс", "ору", "орево"]
good_words = ["спасибо","пасиб", "сяп", "благодарю", "благодарность",
			"помог ", "sps", "дякую", "мерси", "лайк","лойс",
			"сенкс", "респект", "храни тебя бог", "дякую", "thx", "thanks", "thank you"] + popular_good_words
bad_words = ["говно", "пидор", "жопа", "даун", "дурак", "пизда", "дебил", 
			"урод", "сука", "мразь", "блядь", "гондон", "лох", "лошара", "хуй", "хуи", "шлюха", "пидр", "чмо"]

good_emoji = "❤😂👍🔥😆💋😘😍😜👍🏻👍🏻👍🏼👍🏽👍🏾👍🏿"
bad_emoji = "😡👎💩👎🏻👎🏼👎🏽👎🏾👎🏿"
