# Кое-какие настройки для бота
# id тех, кто может менять карму без ограничений
gods = [55910350]

# Бот в текущей сборке расчитан на работу с heroku.com
# Это ссылка на приложение, для установления вебхука
url = "https://khabarabot.herokuapp.com/bot"

# Имя бота (то, которое @Karmator_bot)
bot_name = "khabara_bot"

# Ссылка на Github репозиторий этого бота
adminschat = "@jcrush, @Odmin_khv, @it_was_a_trap, @kroukys_Oo"

# Слова, на которые реагирует бот
popular_good_words = ["спс", "ору", "орево", "👍"]
good_words = ["спасибо","пасиб", "сяп", "благодарю", "благодарен", "благодана", "дякую", "мерси", "лайк","лойс", "сенкс", "респект", "храни тебя бог", "дякую", "thx", "thanks", "thank you"] + popular_good_words
			
bad_words = ["неблагодарный", "неблагодарная", "👎"]
mat_words = ["уеб", "ебал", "ебать", "пизд", "хуй", "хуи", "хуя", "хую", "бля"]
heppy_words = ["с новым годом", "поздравляю", "с рождеством", "молодец", "христос воскрес", "с днем рождения", "с днём рождения", "с праздником", "с 8 марта", "с 23 феврала", "щастья тебе", "я люблю тебя"]

good_emoji = "❤😂👍🔥😆💋😘😍😜"
bad_emoji = "😡👎💩"
